"""Дан список, заполненный произвольными числами. Получить список из элементов исходного, удовлетворяющих следующим
условиям: Элемент кратен 3, Элемент положительный, Элемент не кратен 4. Примечание: Список с целыми числами создайте
вручную в начале файла. Не забудьте включить туда отрицательные числа. 10-20 чисел в списке вполне достаточно. """

numbers = [-5, -2, -1, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 62, 36, 158, 78, 99]
list_required_numbers = [number for number in numbers if number > 0 and number % 3 == 0 and number % 4 != 0]
print(list_required_numbers)
