"""Написать функцию которая принимает на вход число от 1 до 100. Если число равно 13, функция поднимает
исключительную ситуации ValueError иначе возвращает введенное число, возведенное в квадрат. Далее написать основной
код программы. Пользователь вводит число. Введенное число передаем параметром в написанную функцию и печатаем
результат, который вернула функция. Обработать возможность возникновения исключительной ситуации, которая поднимается
внутри функции. """


def number_thirteen(number):
    if 0 > number or number > 100:
        print('Число должно входить в диапазон от 0 до 100!')
    else:
        if number == 13:
            raise ValueError
        else:
            return number ** 2


number = int(input('Введите число'))

try:
    result = number_thirteen(number)
except ValueError:
    print('Несчастивое число')
else:
    if 0 <= number <= 100:
        print(result)
    else:
        print('Введите число заново')
