"""Используя цикл, запрашивайте у пользователя число, пока оно не станет больше 0, но меньше 10. После того,
как пользователь введет корректное число, возведите его в степень 2 и выведите на экран. Например, пользователь
вводит число 123, вы сообщаете ему, что число неверное, и говорите о диапазоне допустимых. И просите ввести заново.
Допустим, пользователь ввел 2, оно подходит. Возводим его в степень 2 и выводим 4 """
number = int(input('Введите число в диапазоне от 0 до 10: '))

while True:
    if 0 < number < 10:
        print('Вы попали в диапазон от 0 до 10')
        print(number ** 2)
        break
    else:
        print('Вы ввели число, которое не входит в необходимый диапозон. Попробуйте ещё раз ')
        number = int(input('Введите число в диапазоне от 0 до 10: '))
