"""Создайте функцию, принимающую на вход имя, возраст и город проживания человека. Функция должна возвращать строку
вида «Василий, 21 год(а), проживает в городе Москва» """


def human(name, age, city):
    result = '{}, {} года(а), проживает в городе {}'.format(name, age, city)
    return result


name = input('Введите имя:')
age = input('Введите возраст:')
city = input('Введите город проживания:')

print(human(name, age, city))
